#使用f-string的字串格式化

#創三個變量
NT1 = 3.321
NT2 = -77
NT3 = 15.11
#印出
print(f"價格1為 {NT1}\n") 
print(f"價格2為 {NT2}\n")
print(f"價格3為 {NT3}\n")
#--------------------------------------小數點格式相同-----------------------------

#貼上你上面的東西 例:
#print(f"價格1為 {NT1}\n")
#print(f"價格2為 {NT2}\n")
#print(f"價格3為 {NT3}\n")
#小數點的精確度 我tm連精確度是甚麼我都不知道
print(f"價格1為 {NT1:.2f}\n")
print(f"價格2為 {NT2:.2f}\n")
print(f"價格3為 {NT3:.2f}\n")
#只會出現小數點後兩位
#--------------------------------------加上正號和負號-----------------------------
print(f"價格1為 {NT1:+.2f}\n")
print(f"價格2為 {NT2:+.2f}\n")
print(f"價格3為 {NT3:+.2f}")
#--------------------------------------文字置中對齊(加上^)----------------------------
print(f"價格1為 {NT1:^.2f}\n")
print(f"價格2為 {NT2:^.2f}\n")
print(f"價格3為 {NT3:^.2f}")
#--------------------------------------文字向右對齊(加上10)----------------------------
print(f"價格1為 {NT1:10.2f}\n")
print(f"價格2為 {NT2:10.2f}\n")
print(f"價格3為 {NT3:10.2f}")
#--------------------------------------文字向左對齊(加上<)----------------------------
print(f"價格1為 {NT1:<.2f}\n")
print(f"價格2為 {NT2:<.2f}\n")
print(f"價格3為 {NT3:<.2f}")
#-------------------------------------混和---------------------------------
print(f"價格1為 {NT1:10.2f}\n")
print(f"價格2為 {NT2:^.2f}\n")
print(f"價格3為 {NT3:<.2f}")