#複利計算機
#例:10000 * (1 + 5 / 100) **2
#總金額(10000)
#利率(5)
#存了幾年(2)
年限 = 0
本金 = 0
利率 = 0
#初始化

#---------------------------------取得本金--------------------
while 本金 <= 0:
    本金 = float(input("請輸入本金金額:"))
    #如果本金是0的話
    if 本金 <= 0:
        print("本金金額不能小於或是等於零")

#--------------------------------取得利率----------------------------------

while 利率 <= 0:
    #讓使用輸入利率
    利率 = float(input("請輸入利率:"))
    #如果使用者又輸入0
    if 利率 <= 0:
        print("請重新輸入利率 注意利率不能小於或等於0")
#--------------------------------取得年限---------------------------

while 年限 <= 0:
    年限 = int(input("請輸入年限:"))
    if 年限 <= 0:
        print("你的年限不能是0")
#-------------------------------把數字(文字)放在下方---------------
print("金額",本金)
print("年限",年限)
print("利率",利率)
#-----------------------------------計算開始-------------------
total = 本金 * (1 + (利率 / 100)) ** 年限
print("你的總金額是",total)